# 1 Напишете програма, която дава възможност на потребителя да въвежда неограничен брой цели числа. Да се изведе какъв
# е процента на числата ,които са кратни на 7, резултата да се закръгли до втория знак след десетичната запетая . Да
# се изведе каква е сумата на числата , които не са кратни на 7. Да се изведе максималното число измежду всички
# числа. Да се намери средноаритметичното на числата кратни на седем, резултата да се закръгли до втория знак след
# десетичната запетая.

# def get_seven_kr_pr(arr: list):
#     res = list()
#     for i in arr:
#         if i % 7 == 0:
#             res.append(i)
#     return round((len(res) / len(arr) * 100), 2)
#
#
# def get_sum_not_seven(arr: list):
#     res = list()
#     for i in arr:
#         if i % 7 != 0:
#             res.append(i)
#     return sum(res)
#
#
# def get_seven_kr_avr(arr: list):
#     res = list()
#     for i in arr:
#         if i % 7 == 0:
#             res.append(i)
#     return round(sum(res) / len(res), 2)
#
#
# my_list = list()
#
# while True:
#     try:
#         num = int(input("Enter a num:"))
#         my_list.append(num)
#     except ValueError:
#         break
#
# print(get_seven_kr_pr(my_list))
# print(get_sum_not_seven(my_list))
# print(max(my_list))
# print(get_seven_kr_avr(my_list))
# # print(my_list)


# 2 Да се напише програма, която реализира играта „познай числото“ : потребителя въвежда цяло число в интервала от 1
# до 10. Програмата също генерира едно случайно число. Ако потребителя е въвел същото число ,което е генерирано от
# програмата се принтира съобщение : „Позна числото“ ,   в противен случай се принтира съобщение : „Съжалявам не
# позна “. и така продължава този процес на въвеждане на число докато потребителя не въведе 0 , нулата е знак за край
# на играта. След като приключи играта на екрана да се принтира общия брой опити на потребителя, както и броя на
# познатите числа.

import random, sys
#
# count, trys = 0, 0
# while True:
#     rand_num = random.randint(1, 10)
#     while True:
#         print(rand_num)
#         ur_num = int(input("Guess the number: "))
#         if rand_num > ur_num:
#             print('WRONG!')
#             trys += 1
#         elif ur_num > rand_num:
#             print('WRONG!')
#             trys += 1
#         else:
#             print("You guessed the number: ", rand_num)
#             count += 1
#             break
#
#         if ur_num == 0:
#             print("Wins: ", count, "Trys", trys - 1)
#             sys.exit()


# 3 Сезона за каране на ски е вече тук. Сформира се голяма група приятели, които  възнамеряват да отидат на ски
# почивка. Някои от тях се нуждаят от подновяване на  екипировката си. Ето защо първоначално трябва да се прочете
# броя на скиорите, които ще купят екипировка. След това на отделни редове  получаваме броя на якета, каски и ски
# обувките, които ще бъдат закупени от  един скиор. Трябва да се има предвид следния ценоразпис: • Якета - 120 лв. •
# Каски – 75 лв. • Комплект обувки – 299,90 лв. Към крайната сума се начислява допълнително 20% ДДС. Да се напише
# програма,  която изчислява общата сумата, която скиорите трябва да заплатят. Забележка: Един скиор съвсем спокойно
# може да закупи повече от 1 яке, каска или  комплект обувки

# count = int(input("броя на скиорите: "))
# total = 0
#
# for i in range(count):
#     jacket = int(input("jackets:"))#120
#     helmet = int(input("helmets:"))#75
#     ski = int(input("ski:"))#299.90
#
#     total += jacket*120 + helmet*75 + ski*299.90
#
# print(round((total*20/100 + total), 2))


# 4